Repository: pikougi-nabot/epochrefs-old
Catalog: commit/84000/data-translation-memory/toh44-45_84000-the-stem-array.tmx/chapters-5-9.tmx
Source language: bo
Languages: en

source: །ཁོ་བོའི་དྲུང་དུ་ཤར་ཕྱོགས་ལོགས་ནས་ལྷ་དང་ལྷའི་དབང་པོའམ། ཀླུ་དང་ཀླུའི་དབང་པོ་འམ། གནོད་སྦྱིན་དང་གནོད་སྦྱིན་གྱི་དབང་པོ་འམ། དྲི་ཟ་དང་དྲི་ཟའི་དབང་པོ་འམ།
en: “Beings have arrived before me to the east.

source: ལྷ་མ་ཡིན་དང་ལྷ་མ་ཡིན་གྱི་དབང་པོའམ། ནམ་མཁའ་ལྡིང་དང་ནམ་མཁའ་ལྡིང་གི་དབང་པོའམ། མིའམ་ཅི་དང་མི་འམ་ཅིའི་དབང་པོའམ། ལྟོ་འཕྱེ་ཆེན་པོ་དང་། ལྟོ་འཕྱེ་ཆེན་པོའི་དབང་པོ་འམ། མི་དང་མིའི་དབང་པོའམ། ཚངས་པ་དང་། ཚངས་པའི་དབང་པོའམ།
en: There are devas and deva lords, nāgas and nāga lords, yakṣas and yakṣa lords, gandharvas and gandharva lords, asuras and asura lords, garuḍas and garuḍa lords, kinnaras and kinnara lords, mahoragas and mahoraga lords, humans and human lords, brahmins and brahmin lords.

source: སེམས་ཅན་གང་སུ་འོངས་ཀྱང་རུང་སྟེ། དེ་དག་ཐམས་ཅད་དེ་བཞིན་གཤེགས་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་སྣང་བའི་ཆོས་ཀྱི་རྣམ་གྲངས་ཀུན་ནས་མིག་ཅེས་བྱ་བ་འདི་ཉིད་དུ་ལ་རབ་ཏུ་བཀོད་ཅིང་བཙུད་དེ།
en: I establish them in and bring them all into this Dharma teaching called All-Seeing Eyes that illuminates the conduct of the tathāgatas and bodhisattvas.

source: དེ་དག་ཀུན་ཀྱང་ཀུན་ནས་མིག་གི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཉིད་ལ་མོས་པར་བྱས་སོ། །རྟོག་ཏུ་བཙུད་དོ། །ཡོངས་སུ་བསྟན་ཏོ། །ཡང་དག་པར་བརྗོད་དོ། །ཡོངས་སུ་གསལ་བར་བྱས་སོ། །རྣམ་པར་ཕྱེའོ། །རྒྱས་པར་བྱས་སོ། །མངོན་པར་བསྟན་ཏོ། །རྣམ་པར་བཀྲོལ་ལོ་རབ་ཏུ་ཕྱེའོ།
en: For all of them I clarify, delineate, elucidate, describe, teach, categorize, expand, reveal, expound, and illuminate this Dharma teaching called All-Seeing Eyes

source: །ཤིན་ཏུ་སྣང་བར་བྱས་སོ། །དེ་ལྟར་ཤར་ཕྱོགས་ལ་ཇི་ལྟ་བ་དེ་བཞིན་དུ་ལྷོ་ཕྱོགས་དང་། ནུབ་ཕྱོགས་དང་། བྱང་ཕྱོགས་དང་། བྱང་ཤར་གྱི་ཕྱོགས་མཚམས་དང་། ཤར་ལྷོའི་ཕྱོགས་མཚམས་དང་། ལྷོ་ནུབ་ཀྱི་ཕྱོགས་མཚམས་དང་། ནུབ་བྱང་གི་ཕྱོགས་མཚམས་དང་། འོག་དང་བླའི་ཕྱོགས་ནས་སེམས་ཅན་གང་སུ་འོངས་ཀྱང་རུང་སྟེ། ཀུན་ལ་ཡང་སྔ་མ་བཞིན་ནོ།
en: “As in the east, it is the same for the beings who arrive to the south, the west, the north, the northeast, the southeast, the southwest, the northwest, above, and below.

source: །རིགས་ཀྱི་བུ་དེ་ལྟར་ཁོ་བོས་ནི་ཆོས་ཀྱི་རྣམ་གྲངས་གཅིག་ཅིག་ཤེས་པར་ཟད་ན།
en: “Noble one, in this way I know but one Dharma teaching.

source: བྱང་ཆུབ་སེམས་དཔའི་སྨོན་ལམ་ཡོངས་སུ་དག་པ་དང་ལྡན་པས།
en: How could I know the conduct or describe the qualities of bodhisattvas?

source: བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་རྒྱ་མཚོ་ཐམས་ཅད་ལ་ཞུགས་པ།
en: They have entered the ocean of bodhisattva conduct in order to gain pure aspiration;

source: བསྐལ་པ་ཐམས་ཅད་དུ་གནས་པ་རྒྱུ་མི་འཆད་པའི་ཕྱིར་སྨོན་ལམ་རྒྱ་མཚོ་ཐམས་ཅད་ལ་ཞུགས་པ་དང་། བསམ་པ་ཇི་ལྟ་བ་བཞིན་དུ་རྗེས་སུ་འབྲང་བར་བྱ་བའི་ཕྱིར་སེམས་ཅན་རྒྱ་མཚོ་ཐམས་ཅད་ལ་ཞུགས་པ་དང་། སྟོབས་བཅུའི་ཡེ་ཤེས་ཆགས་པ་མེད་པའི་སྣང་བ་ཡོངས་སུ་བསྐྱེད་པའི་ཕྱིར་འགྲོ་བ་ཐམས་ཅད་ཀྱི་སེམས་རྒྱ་མཚོ་ལ་ཞུགས་པ་དང་། ཡོངས་སུ་སྨིན་པར་བྱ་བ་དང་། གདུལ་བའི་དུས་ལ་མི་འདའ་བར་བྱ་བའི་ཕྱིར་སེམས་ཅན་ཐམས་ཅད་ཀྱི་དབང་པོ་རྒྱ་མཚོ་ལ་ཞུགས་པ་དང་། ཞིང་ཐམས་ཅད་རྣམ་པར་དག་པར་བྱ་བའི་སྨོན་ལམ་མངོན་པར་བསྒྲུབས་པས།
en: they have entered the ocean of all aspirations in order to remain continuously throughout all kalpas; they have entered the ocean of all beings in order to follow a conduct that accords with their wishes; they have entered the ocean of the minds of all beings in order to communicate wisdom; they have entered the ocean of all good qualities in order to develop the unimpeded radiance of the wisdom of the ten strengths; they have entered the ocean of the faculties of all beings in order not to miss the time for ripening and guiding them;

source: ཞིང་རྒྱ་མཚོ་ཐམས་ཅད་ལ་ཞུགས་པ་དང་། དེ་བཞིན་གཤེགས་པ་ལ་མཆོད་ཅིང་རིམ་གྲོ་བྱེད་པའི་སྟོབས་ཀྱིས་སངས་རྒྱས་རྒྱ་མཚོ་ཐམས་ཅད་ལ་ཞུགས་པ་དང་། ཡེ་ཤེས་རྣམ་པར་རིག་པས་ཆོས་རྒྱ་མཚོ་ཐམས་ཅད་ལ་ཞུགས་པ་དང་། ནན་ཏན་དང་ལྡན་པས་ཡོན་ཏན་རྒྱ་མཚོ་ཐམས་ཅད་ལ་ཞུགས་པ་དང་། བརྗོད་པ་ཐམས་ཅད་དུ་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བ་མངོན་པར་བསྒྲུབ་པའི་ཕྱིར། འགྲོ་བའི་སྐད་རྒྱ་མཚོ་ཐམས་ཅད་ལ་ཞུགས་པ་རྣམས་ཀྱི་སྤྱོད་པ་ཤེས་པའམ།
en: they have entered the ocean of realms in order to fulfill the aspiration to purify all realms; they have entered the ocean of buddhas in order to serve and make offerings to the tathāgatas; they have entered the ocean of Dharma in order to communicate wisdom; they have entered the ocean of good qualities in order to reach attainment; and they have entered the ocean of the languages of beings in order to turn the wheel of the Dharma in all languages.

source: ཡོན་ཏན་བརྗོད་པར་ནུས་རེ་སྐན།
en: “Depart, noble one.

source: །སོང་རིགས་ཀྱི་བུ་འདི་ནས་དཔག་ཚད་དྲུག་ཅུ་འདས་པའི་ལྷོ་ཕྱོགས་ཀྱི་གནས་འདི་ཉིད་ན། ལང་ཀའི་གནས་རྒྱ་མཚོའི་དོགས་ཤེས་བྱ་བ་ཡོད་དེ།
en: Sixty yojanas from here on the road south, there is a place named Sāgara­tīra on the road to Laṅka.

source: དེ་ན་དགེ་སློང་ཤིན་ཏུ་བརྟན་པ་ཞེས་བྱ་བ་འདུག་གིས།
en: There dwells a bhikṣu by the name of Supratiṣṭhita.

source: དེའི་གན་དུ་སོང་ལ། ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཡོངས་སུ་སྦྱང་བར་བྱ་བ་དྲིས་ཤིག །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་དགེ་སློང་རྒྱ་མཚོའི་སྤྲིན་གྱི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ།
en: Go to him and ask him, ‘How does a bodhisattva train in bodhisattva conduct?’

source: དགེ་སློང་རྒྱ་མཚོའི་སྤྲིན་ལ་ལན་བརྒྱ་སྟོང་དུ་མར་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ནས་ཡང་དང་ཡང་བལྟས་ཏེ། དགེ་སློང་རྒྱ་མཚོའི་སྤྲིན་གྱི་དྲུང་ནས་སོང་ངོ་།
en: Then Sudhana, the head merchant’s son, bowed his head to the feet of the bhikṣu Sāgara­megha, circumambulated the bhikṣu Sāgara­megha many hundreds of thousands of times, keeping him to his right, and, looking back again and again, departed from the bhikṣu Sāgara­megha.

source: །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་དགེ་བའི་བཤེས་གཉེན་གྱི་གདམས་ངག་དེ་དང་། ཀུན་ནས་མིག་གི་ཆོས་ཀྱི་རྣམ་གྲངས་དེ་ཡང་རྗེས་སུ་དྲན་པར་བྱེད་ཅིང་དེ་བཞིན་གཤེགས་པའི་རྣམ་པར་འཕྲུལ་པ་དེ་ཡང་རྗེས་སུ་བསམ་པ་དང་། ཆོས་ཀྱི་ཚིག་དང་ཡི་གེའི་སྤྲིན་དེ་དག་ཀྱང་ཡོངས་སུ་གཟུང་བ་དང་། ཆོས་ཀྱི་སྒོ་རྒྱ་མཚོའི་ཚུལ་དེ་དག་ལའང་འཇུག་པར་བྱ་བ་དང་ཆོས་ཀྱི་ཚུལ་དེའང་རྣམ་པར་བལྟ་བ་དང་། ཆོས་ཀྱི་ལེའུ་དང་གློང་གི་ཚུལ་དེ་དག་ལ་འཇུག་པར་བྱ་བ་དང་། ཆོས་ཀྱི་ནམ་མཁའ་དེ་ལ་ཡང་དག་པར་གཞོལ་བར་བྱ་བ་དང་། ཆོས་ཀྱི་དཀྱིལ་འཁོར་དེ་ཡང་རྗེས་སུ་སྦྱང་བར་བྱ་བ་དང་། ཆོས་རིན་པོ་ཆེའི་གླིང་དེ་ཡང་རྗེས་སུ་སེམས་ཤིང་མཐར་གྱིས་ལང་ཀའི་གནས་རྒྱ་མཚོའི་ངོགས་ཤེས་བྱ་བ་གདན་པ་དེར་ཕྱིན་ནས།
en: Supratiṣṭhita Then Sudhana, the head merchant’s son, remembering the instructions of the kalyāṇamitra and the Dharma teaching called All-Seeing Eyes , contemplating the miracles of that tathāgata, keeping in his mind the clouds of the words and terms of that Dharma, comprehending that ocean of Dharma gateways, observing the precepts of that Dharma, entering those ways of turning toward the Dharma, absorbed into the sky of that Dharma, purifying the range of that Dharma, and meditating on the precious continent of that Dharma, eventually arrived at Sāgara­tīra in the Laṅka region. Wishing to see the bhikṣu Supratiṣṭhita, he looked for him in the eastern direction.

source: དགེ་སློང་ཤིན་ཏུ་བརྟན་པ་མཐོང་བར་དགའ་ཞིང་ཤར་ཕྱོགས་སུ་བལྟས་སོ།
en: In the same way, wishing to see the bhikṣu Supratiṣṭhita, he looked for him everywhere:

source: །དེ་བཞིན་དུ་ལྷོ་ཕྱོགས་དང་། ནུབ་ཕྱོགས་དང་། བྱང་ཕྱོགས་དང་། བྱང་ཤར་གྱི་ཕྱོགས་མཚམས་དང་། ཤར་ལྷོའི་ཕྱོགས་མཚམས་དང་། ལྷོ་ནུབ་ཀྱི་ཕྱོགས་མཚམས་དང་། ནུབ་བྱང་གི་ཕྱོགས་མཚམས་དང་། བླ་དང་འོག་ཏུ་དགེ་སློང་ཤིན་ཏུ་བརྟན་པ་མཐོང་བར་དགའ་སྟེ།
en: in the southern direction, in the western direction, in the northern direction, in the northeastern direction, in the southeastern direction, in the southwestern direction, in the northwestern direction, above, and below.

source: ཀུན་ཏུ་བལྟས་པ་དང་། དེས་དགེ་སློང་ཤིན་ཏུ་བརྟན་པ་ནམ་མཁའི་དབྱིངས་ལ་ལྷ་བརྒྱ་སྟོང་གྲངས་མེད་པས་ཡོངས་སུ་བསྐོར་ཅིང་ཕན་ཚུན་དུ་འཆག་པ་མཐོང་ངོ་།
en: Then he saw the bhikṣu Supratiṣṭhita walking back and forth in the sky accompanied by countless hundreds of thousands of devas.

source: །ནམ་མཁའི་དབྱིངས་དེ་ཡང་ལྷའི་དབང་པོ་རྣམས་ཀྱིས་དགེ་སློང་ཤིན་ཏུ་བརྟན་པ་ལ་མཆོད་པའི་ལས་སུ་བྱ་བའི་ཕྱིར། ལྷ་རྫས་ཀྱི་མེ་ཏོག་སིལ་མའི་སྤྲིན་གྱིས་ཡོག་པ་དང་། ལྷ་རྫས་ཀྱི་རོལ་མོའི་སྤྲིན་གྱི་སྒྲ་དང་། དར་གྱི་བ་དན་གྲངས་མེད་པའི་རྒྱན་གྱིས་བརྒྱན་པར་མཐོང་ངོ་།
en: He saw deva lords in the sky making offerings to the bhikṣu Supratiṣṭhita with clouds of scattered divine flower petals, the sound of countless clouds of divine music, and countless adorning streamers and banners.

source: །ཀླུའི་དབང་པོ་རྣམས་ཀྱིས་ནམ་མཁའ་དེ་ལ་ཨ་ག་རུ་ནག་པོའི་སྤོས་མངོན་པར་འཐུལ་བའི་སྤྲིན་ཤིན་ཏུ་མཐོ་བ་ལས་འབྲུག་སྒྲ་བསམ་གྱིས་མི་ཁྱབ་པ་འབྱུང་བར་བྱས་པ་མཐོང་ངོ་།
en: He saw that nāga lords in the sky had created high clouds, made of the spreading incense smoke of black agarwood, from which came inconceivable claps of thunder.

source: །མི་འམ་ཅིའི་དབང་པོ་རྣམས་ཀྱིས་ནམ་མཁའ་དེ་ལ་ལྷ་རྫས་ཀྱི་ངག་སྙན་པའི་རྒྱུད་ཀྱི་བསྟོད་པའི་རོལ་མོ་བརྡུང་བ་དང་། དཀྲོལ་བ་དང་གླུར་བླང་བའི་དབྱངས་ཐམས་ཅད་སྦྱར་ཅིང་བླངས་པ་ཐོས་པར་གྱུར་ཏོ།
en: He heard kinnara lords offering their divine beautiful voices in songs of praise and the sounds of a concert with all musical instruments being played.

source: །ལྟོ་འཕྱེ་ཆེན་པོའི་དབང་པོ་རྣམས་ཀྱིས་ནམ་མཁའ་དེ་ལ་གོས་ཤིན་ཏུ་ཕྲ་ཞིང་མདོག་བཟང་བའི་སྤྲིན་བསམ་གྱིས་མི་ཁྱབ་པ་དག་ཡིད་དགའ་བས་བཀྱེ་སྟེ། དགེ་སློང་ཤིན་ཏུ་བརྟན་པ་ལ་དད་ཅིང་མོས་པའི་གཟུགས་སུ་ཕྱུང་བ་མཐོང་ངོ་།
en: He saw mahoraga lords in the sky joyfully and with faith bringing forth an inconceivable cloud of fine clothing in beautiful colors, with the appearance of delighting in the bhikṣu Supratiṣṭhita.

source: །ལྷ་མ་ཡིན་གྱི་དབང་པོ་རྣམས་ཀྱིས་ཀྱང་ནམ་མཁའ་དེ་ལ་ནོར་བུ་རིན་པོ་ཆེའི་སྤྲིན་བསམ་གྱིས་མི་ཁྱབ་པ་བྱིན་གྱིས་བརླབས་ཏེ། ཡོན་ཏན་བསམ་གྱིས་མི་ཁྱབ་པའི་རྒྱན་སྣང་བ་དང་ལྡན་པར་བྱས་པ་མཐོང་ངོ་།
en: He saw asura lords in the sky conjuring an inconceivable cloud of precious jewels shining with an inconceivable display of qualities.

source: །ནམ་མཁའ་ལྡིང་གི་དབང་པོ་མང་པོ་ཡང་མྱིའི་གཟུགས་དང་ཁ་དོག་དང་དབྱིབས་སུ་འཁོད་ཅིང་ནམ་མཁའ་ལྡིང་གི་དབང་པོའི་བུ་མོས་ཀུན་ནས་བསྐོར་ཏེ། གསོད་པ་མེད་པ་ལ་དགའ་ཞིང་ཐལ་མོ་སྦྱར་ཏེ་གནས་པ་བསམ་གྱིས་མི་ཁྱབ་པ་མཐོང་ངོ་།
en: He saw a gathered multitude of garuḍa lords in human form, color, and shape, encircled by the daughters of the garuḍa lords, delighting in nonviolence and with their palms together in homage.

source: །གནོད་སྦྱིན་གྱི་དབང་པོ་བརྒྱ་སྟོང་འཁོར་དང་བཅས་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དག་ཀྱང་ནམ་མཁའ་དེ་ལ་ཤིན་ཏུ་མི་སྡུག་པའི་གཟུགས་སུ་དགེ་སློང་ཤིན་ཏུ་བརྟན་པ་ལ་བྱམས་པའི་མཐུ་དང་ལྡན་པར་འཁོད་པ་མཐོང་ངོ་།
en: He saw an inconceivable hundred thousand yakṣa lords, arranged with their retinues in the sky, who had very ugly bodies and the power of love toward the bhikṣu Supratiṣṭhita.

source: །སྲིན་པོའི་དབང་པོ་བརྒྱ་སྟོང་འཁོར་དང་བཅས་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དག་ཀྱང་ནམ་མཁའ་དེ་ལ་དགེ་སློང་ཤིན་ཏུ་བརྟན་པ་ཡོངས་སུ་བསྲུང་བ་བྱེད་ཅིང་ཀུན་ཏུ་རྒྱུ་བ་མཐོང་ངོ་།
en: He saw an inconceivable hundred thousand rākṣasa lords with their retinues in the sky who circled around the bhikṣu Supratiṣṭhita, guarding him.

source: །ཚངས་པའི་དབང་པོ་བརྒྱ་སྟོང་བསམ་གྱིས་མི་ཁྱབ་པ་དག་ཀྱང་ནམ་མཁའ་དེ་ལ་ཐལ་མོ་སྦྱར་ཅིང་དགའ་བ་དང་ཡིད་དུ་འོང་བའི་ཚིག་གི་རྒྱུད་ཀྱི་བསྟོད་པ་རབ་ཏུ་བརྗོད་པ་མཐོང་ངོ་།
en: He saw an inconceivable hundred thousand Brahmakāyika lords with their retinues in the sky with their palms together in homage, engaged in singing his praises with beautiful, melodious voices.

source: །གནས་གཙང་མའི་ལྷ་བརྒྱ་སྟོང་བསམ་གྱིས་མི་ཁྱབ་པ་དག་ཀྱང་ནམ་མཁའ་དེ་ལ་དགེ་སློང་ཤིན་ཏུ་བརྟན་པ་ལ་མཆོད་པའི་ལས་སུ་བྱ་བའི་ཕྱིར་ཐལ་མོ་སྦྱར་ཅིང་གཞལ་མེད་ཁང་ན་གནས་པ་མཐོང་ངོ་།
en: He saw an inconceivable hundred thousand Śuddhāvāsa devas in their aerial palaces in the sky making offerings to the bhikṣu Supratiṣṭhita.

source: །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་དགེ་སློང་ཤིན་ཏུ་བརྟན་པ་དེ་ལྟར་ནམ་མཁའི་དབྱིངས་ལ་འཆག་ཅིང་འདུག་པ་མཐོང་ནས་དགའ་རངས་ཏེ་མགུ་ཞིང་ཉམས་བདེ་ལ་ཚིམ་ཞིང་ཡིད་བདེ་བ་སྐྱེས་ནས།
en: Sudhana, the head merchant’s son, on seeing the bhikṣu Supratiṣṭhita walking in the sky, was filled with joy, delighted, elated, pleased, and happy.

source: དགེ་སློང་ཤིན་ཏུ་བརྟན་པ་ལ་ཐལ་མོ་སྦྱར་ཏེ་ཕྱག་འཚལ་ནས་འདི་སྐད་ཅེས་སྨྲས་སོ། །འཕགས་པ་བདག་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ནས།
en: He placed his palms together in homage and said, “Ārya, I have developed the aspiration for the highest, complete enlightenment, but I do not know this—how should a bodhisattva seek for the Buddhadharma? How should a bodhisattva obtain the Buddhadharma? How should a bodhisattva compile the Buddhadharma? How should a bodhisattva serve the Buddhadharma? How should a bodhisattva protect the Buddhadharma?

source: ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔའི་སངས་རྒྱས་ཀྱི་ཆོས་བཙལ་བར་བགྱི་བ་དང་། ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་སངས་རྒྱས་ཀྱི་ཆོས་ཡོངས་སུ་བསྒྲུབ་པར་བགྱི་བ་དང་། ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་སངས་རྒྱས་ཀྱི་ཆོས་ཡོངས་སུ་བསྡུ་བར་བགྱི་བ་དང་། ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་སངས་རྒྱས་ཀྱི་ཆོས་བསྟན་པར་བགྱི་བ་དང་། ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་སངས་རྒྱས་ཀྱི་ཆོས་བསྒོམ་པར་བགྱི་བ་དང་། ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་སངས་རྒྱས་ཀྱི་ཆོས་ཀྱི་རྗེས་སུ་འབྲང་བར་བགྱི་བ་དང་། ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་སངས་རྒྱས་ཀྱི་ཆོས་ཡོངས་སུ་བརྟུལ་བར་བགྱི་བ་དང་། ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་སངས་རྒྱས་ཀྱི་ཆོས་ཡོངས་སུ་བསྒོམ་པར་བགྱི་བ་དང་། ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་སངས་རྒྱས་ཀྱི་ཆོས་རྣམ་པར་དག་པར་བགྱི་བ་དང་། ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་སངས་རྒྱས་ཀྱི་ཆོས་ཡོངས་སུ་སྦྱང་བར་བགྱི་བ་དང་། ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་སངས་རྒྱས་ཀྱི་ཆོས་ཁོང་དུ་ཆུད་པར་བགྱི་བ་མ་འཚལ་ཏེ།
en: How should a bodhisattva follow the Buddhadharma? How should a bodhisattva accumulate the Buddhadharma? How should a bodhisattva pervade the Buddhadharma? How should a bodhisattva purify the Buddhadharma? How should a bodhisattva train in the Buddhadharma? How should a bodhisattva understand the Buddhadharma?

source: འཕགས་པ་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་གདམས་ངག་དང་རྗེས་སུ་བསྟན་པ་མཛད་དོ། །ཞེས་བདག་གིས་ཐོས་ན།
en: “Ārya, I have heard that you give instruction and teachings to bodhisattvas!

source: འཕགས་པ་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་སངས་རྒྱས་ཀྱི་ཆོས་ལ་ནན་ཏན་དུ་བགྱི།
en: Therefore, Ārya, teach me how bodhisattvas should practice the Buddhadharma so that while practicing they will not lack the sight of the Buddha in order to not become separated from the truth;

source: ཇི་ལྟར་ནན་ཏན་བགྱིས་ན་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དང་། སྐོལ་བར་མི་འགྱུར་བའི་སླད་དུ་སངས་རྒྱས་མཐོང་བ་དང་མི་འབྲལ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་དགེ་བའི་རྩ་བ་དང་། ཚུལ་གཅིག་ཏུ་འགྱུར་བའི་སླད་དུ་བྱང་ཆུབ་སེམས་དཔའ་མཐོང་བ་དང་མི་འབྲལ་བ་དང་། ཡེ་ཤེས་རྟོགས་པར་འགྱུར་བའི་སླད་དུ་སངས་རྒྱས་ཀྱི་ཆོས་དང་མི་འབྲལ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་དོན་ཡོངས་སུ་ཐོབ་པར་བགྱི་བའི་སླད་དུ་བྱང་ཆུབ་སེམས་དཔའི་སྨོན་ལམ་ཐམས་ཅད་དང་མི་འབྲལ་བ་དང་། བསྐལ་པ་ཐམས་ཅད་དུ་གནས་པས་ཡོངས་སུ་མི་སྐྱོ་བར་བགྱི་བའི་སླད་དུ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་དང་མི་འབྲལ་བ་དང་། འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ཡོངས་སུ་དག་པར་བགྱི་བའི་སླད་དུ་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་རྒྱས་པར་དགང་བ་དང་མི་འབྲལ་བ་དང་། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་རྣམ་པར་འཕྲུལ་པ་ཐམས་ཅད་རྣམ་པར་དམིགས་པར་བགྱི་བའི་སླད་དུ་སངས་རྒྱས་ཀྱི་རྣམ་པར་འཕྲུལ་པ་མཐོང་བ་དང་མི་འབྲལ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་སྤྲུལ་པ་ལྟ་བུས་སྲིད་པའི་རྒྱུད་ཐམས་ཅད་དུ་སྐྱེ་ཞིང་འཆི་འཕོ་བའི་སྐྱེ་མཆེད་རང་གི་ལུས་ཀྱིས་ཉམས་སུ་མྱོང་བར་བགྱི་བའི་སླད་དུ་འདུས་བྱས་ཀྱི་གནས་དང་མི་འབྲལ་བ་དང་། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཆོས་ཀྱི་སྤྲིན་ཡོངས་སུ་གཟུང་བའི་སླད་དུ་ཆོས་མཉན་པ་དང་མི་འབྲལ་བ་དང་། དུས་གསུམ་གྱི་ཡེ་ཤེས་ཁོང་དུ་ཆུད་ཅིང་རྗེས་སུ་འབྲང་བར་བགྱི་བའི་སླད་དུ།
en: will not lack the vision of the bodhisattvas in order to have the same way as the roots of merit of all bodhisattvas; will not lack the Buddhadharma in order to realize wisdom; will not lack the bodhisattva aspiration in order to attain all the goals of the bodhisattvas; will not lack bodhisattva conduct in order to never become weary of remaining throughout all kalpas; will not lack the pervading of all buddha realms in order to purify all world realms; will not lack seeing the miracles of buddhas in order to perceive all the miraculous manifestations of all the tathāgatas; will not lack a composite presence so that through bodhisattva conduct that is like a magical creation they will experience as their own bodies the āyatanas that are born and pass away within all existences; will not lack hearing the Dharma in order to obtain the clouds of Dharma of all the tathāgatas;

source: ཡེ་ཤེས་སྣང་བ་དང་མི་འབྲལ་བར་འགྱུར་བ་དེ་བདག་ལ་བསྟན་དུ་གསོལ།
en: and will not lack the light of wisdom in order to gain and use the knowledge of the three times.”

source: དེ་སྐད་ཅེས་སྨྲས་པ་དང་། དགེ་སློང་ཤིན་ཏུ་བརྟན་པས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །དེ་ལྟར་ཁྱོད་ཀྱིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དེ། སངས་རྒྱས་ཀྱི་ཆོས་དང་ཐམས་ཅད་མཁྱེན་པའི་ཆོས་དང་རང་བྱུང་གི་ཆོས་འདྲི་བ་ལེགས་སོ། །ལེགས་སོ། །རིགས་ཀྱི་བུ་ཁོ་བོ་ནི་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་ཐོགས་པ་མེད་པའི་སྒོ་ཐོབ་པ་སྟེ།
en: When he had said this, the bhikṣu Supratiṣṭhita said to Sudhana, the head merchant’s son, “Noble one, it is excellent, excellent, that you have developed the aspiration for the highest, complete enlightenment and that you ask questions about the Buddha’s Dharma, the Dharma of omniscience, the self-arisen Dharma.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་བ་ཐོགས་པ་མེད་པའི་སྒོ་དེ་ཁོ་བོས་བླངས་ཏེ།
en: “Noble one, I have the attainment of the unimpeded gateway, the liberation of a bodhisattva.

source: ཡོངས་སུ་བཟུང་ནས་རྗེས་སུ་འབྲང་ཞིང་རྣམ་པར་དབྱེ་བ་དང་། རྣམ་པར་དཔྱད་པ་དང་རྣམ་པར་བརྟག་པ་དང་སྣང་བར་བྱ་བ་དང་། རབ་ཏུ་སྣང་བར་བྱས་པས་ཐོགས་པ་མེད་པའི་མཐའ་ཞེས་བྱ་བའི་ཡེ་ཤེས་སྣང་བ་ཐོབ་བོ།
en: I have acquired, followed, categorized, analyzed, examined, and elucidated this unimpeded gateway, this liberation of a bodhisattva, and I have attained the light of wisdom called the unimpeded apex

source: །དེ་ཐོབ་པས་ཁོ་བོ་ནི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་དང་སྤྱོད་པ་ཁོང་དུ་ཆུད་པར་བྱ་བ་ལ་ཐོགས་པ་མེད་དོ།
en: Having attained that, I have no impediment in perceiving the minds and conduct of all beings;

source: །སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྐྱེ་བ་དང་འཆི་འཕོ་ཡོངས་སུ་ཤེས་པར་བྱ་བ་ལ་ཐོགས་པ་མེད་དོ།
en: I have no impediment in knowing the births and deaths of all beings;

source: །སྔོན་གྱི་གནས་རྗེས་སུ་དྲན་པར་བྱ་བའི་སྒོར་འཇུག་པ་ལ་ཐོགས་པ་མེད་དོ།
en: I have no impediment in entering the gateway of remembering past lives;

source: །ཕྱི་མའི་མཐའི་བསྐལ་པར་འགྲོ་བ་ཐམས་ཅད་དང་འགྲོགས་པར་བྱ་བ་ལ་ཐོགས་པ་མེད་དོ།
en: I have no impediment in dwelling with all beings in future kalpas;

source: །ད་ལྟར་བྱུང་བའི་དུས་ཀྱི་འགྲོ་བ་ཐམས་ཅད་རྣམ་པར་རིག་པར་བྱ་བ་ལ་ཐོགས་པ་མེད་དོ།
en: I have no impediment in perceiving all the beings of the present time;

source: །སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྒྲ་སྐད་དང་། ཀུན་རྫོབ་ཡོངས་སུ་ཤེས་པར་བྱ་བ་ལ་ཐོགས་པ་མེད་དོ།
en: I have no impediment in knowing the relative languages of all beings;

source: །སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཐེ་ཙོམ་གཅད་པར་བྱ་བ་ལ་ཐོགས་པ་མེད་དོ།
en: I have no impediment in cutting through the doubts of all beings;

source: །སེམས་ཅན་ཐམས་ཅད་ཀྱི་དབང་པོ་ཐ་དད་པར་ཁོང་དུ་ཆུད་པར་བྱ་བ་ལ་ཐོགས་པ་མེད་དོ།
en: I have no impediment in comprehending the different faculties of all beings;

source: །སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྨིན་པར་བྱ་བ་དང་། གདུལ་བའི་དུས་སུ་འགྲོ་བར་བྱ་བ་ལ་ཐོགས་པ་མེད་དོ།
en: I have no impediment in acting at the right time to ripen and guide all beings;

source: །ཉིན་མཚན་དང་སྐད་ཅིག་དང་ཡུད་ཙམ་དང་ཐང་ཅིག་དང་། དུས་ཀྱི་མིང་དུ་བྱ་བ་ཁོང་དུ་ཆུད་པར་བྱ་བ་ལ་ཐོགས་པ་མེད་དོ།
en: I have no impediment in identifying days, nights, seconds, hours, and periods of time;

source: །དུས་གསུམ་རྒྱ་མཚོའི་རྒྱུད་དུ་འཇུག་པར་བྱ་བ་ལ་ཐོགས་པ་མེད་དོ། །ཕྱོགས་བཅུའི་སངས་རྒྱས་ཀྱི་ཞིང་རང་གི་ལུས་ཀྱིས་རྒྱས་པར་དགང་བར་བྱ་བ་ལ་ཐོགས་པ་མེད་དོ། །དེ་ནི་དེ་ལྟར་དངོས་པོ་མེད་པ་ལ་གནས་ཤིང་མངོན་པར་འདུ་བྱ་བ་མེད་པའི་རྫུ་འཕྲུལ་ཐོབ་པའི་ཕྱིར་ཏེ།
en: I have no impediment in entering into the ocean of the three times; and I have no impediment in incorporeally pervading the buddha realms in the ten directions, because I am present without substance and have attained noncomposite miraculous powers.

source: རིགས་ཀྱི་བུ་དངོས་པོ་མེད་པ་ལ་གནས་ཤིང་མངོན་པར་འདུ་བྱ་བ་མེད་པའི་རྫུ་འཕྲུལ་དེའི་བྱིན་གྱིས་ཁོ་བོ་ནམ་མཁའ་དབྱིངས་འདི་ལས་ཕན་ཚུན་དུ་འགྲོ་ཞིང་འདུག་པ་དང་། སྙེས་པ་དང་སྤྱོད་ལམ་སྣ་ཚོགས་སུ་སྤྱོད་དོ།
en: “Noble one, because I am present without substance and have the power of noncomposite miraculous powers, I can walk back and forth, stand, sit, lie down, and perform various activities in the sky.

source: །མི་སྣང་བར་བྱེད་དོ།
en: I can become invisible.

source: །སྣང་བར་འབྱུང་ངོ་།
en: I can reappear.

source: །དུ་བ་འཐུལ་བར་བྱེད་དོ།
en: I can become smoke.

source: །མེ་ལྕེ་འབར་བར་བྱེད་དོ།
en: I can become a fire.

source: །གཅིག་ཏུ་བྱས་ཤིང་མང་པོར་བསྒྱུར་རོ།
en: I can transform from one into many.

source: །མང་པོར་བྱས་ཤིང་གཅིག་ཏུ་བསྒྱུར་རོ།
en: I can transform from many into one.

source: །སྣང་བ་དང་མི་སྣང་བའང་ཉམས་སུ་མྱོང་བར་བྱེད་དོ།
en: I can be both visible and invisible.

source: །རྩིག་པ་ལའང་ཐག་ཐོགས་མེད་པ་དང་རབ་ལའང་ཐག་ཐོགས་མེད་པར་འགྲོ་སྟེ། དཔེར་ན་ནམ་མཁའ་ལ་བྱ་བཞིན་ནོ། །ནམ་མཁའ་ལའང་སྐྱིལ་མོ་ཀྲུང་གིས་འགྲོ་སྟེ། དཔེར་ན་འདབ་ཆགས་བྱ་བཞིན་ནོ།
en: I can pass without impediment through walls and without impediment through city ramparts, as if through space. I travel cross-legged through the air, as a bird does.

source: །ས་ལ་ཡང་བྱིའུ་ཟུལ་དང་སྟེང་དུ་འབྱུང་བ་བྱེད་དེ། དཔེར་ན་ཆུ་ལ་བྱ་བ་བཞིན་ནོ།
en: I can plunge into the earth and reappear the way a bird does in water.

source: །ཆུ་ལ་ཡང་བྱིང་བ་མེད་པར་འགྲོ་སྟེ། དཔེར་ན་ས་ལ་བྱ་བ་བཞིན་ནོ།
en: I can walk on water without sinking like a bird on the ground.

source: །དུ་བ་འཐུལ་བ་དང་། མེ་ལྕེ་འབར་བར་བྱེད་དེ། དཔེར་ན་མེའི་ཕུང་པོ་ཆེན་པོ་བཞིན་ནོ།
en: I can produce smoke and flames the way a great fire does.

source: །ས་ཡང་ཡོངས་སུ་གཡོ་བར་བྱེད་དོ།
en: I can make the ground shake.

source: །ཉི་མ་དང་ཟླ་བ་འདི་གཉིས་དེ་ལྟར་རྫུ་འཕྲུལ་ཆེ་ཞིང་དེ་ལྟར་མཐུ་ཆེ་ལ།
en: I can wipe clean with my hands this sun and this moon that have such great miraculous power, great mightiness, and great brilliance.

source: དེ་ལྟར་གཟི་བརྗིད་ཆེ་ཡང་ལག་པས་ཀུན་ནས་ཡོངས་སུ་ཉུག་གོ །ཚངས་པའི་འཇིག་རྟེན་གྱི་བར་དག་ཏུ་ཡང་ལུས་ཀྱིས་དབང་བསྒྱུར་རོ།
en: My body can dominate everywhere up to and including the world of Brahmā.

source: །འཇིག་རྟེན་སྤོས་ཀྱི་དུད་པ་ན་བུན་དུ་ཆགས་པའི་སྤྲིན་གྱིས་ཀུན་ནས་ཁེབས་པར་བྱས་ཤིང་རབ་ཏུ་འབར་བར་བྱེད་དོ།
en: I can cover the world with a mist formed from clouds of incense smoke and then make it shine.

source: །རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱི་འོད་ཟེར་གྱི་སྤྲིན་གྱི་དྲ་བས་འཇིག་རྟེན་ཀུན་ནས་ཁེབས་པར་བྱས་ཤིང་།
en: I can cover the world with a network of clouds of light rays from all jewels.

source: འགྲོ་བ་ཐམས་ཅད་དང་འདྲ་བའི་སྤྲུལ་པའི་སྤྲིན་རབ་ཏུ་འགྱེད་དོ།
en: I can send forth a cloud of emanations that resemble all beings.

source: །ཁ་དོག་མཐའ་ཡས་པའི་འོད་ཀྱི་དྲ་བའི་སྤྲིན་རབ་ཏུ་བཀྱེ་ཞིང་ཕྱོགས་ཀུན་ཏུ་འང་འགྲོ་སྟེ།
en: “I can emanate clouds of networks of lights of infinite colors that go to all directions and realms.

source: འདི་ལྟར་ཤར་ཕྱོགས་སུ་འགྲོའོ། །ལྷོ་ཕྱོགས་དང་ནུབ་ཕྱོགས་དང་བྱང་ཕྱོགས་དང་། བྱང་ཤར་གྱི་ཕྱོགས་མཚམས་དང་། ཤར་ལྷོའི་ཕྱོགས་མཚམས་དང་། ལྷོ་ནུབ་ཀྱི་ཕྱོགས་མཚམས་དང་། ནུབ་བྱང་གི་ཕྱོགས་མཚམས་དང་། འོག་དང་བླའི་ཕྱོགས་སུ་ཡང་འགྲོའོ།
en: In that way, they go to the east, to the south, to the west, to the north, to the northeast, to the southeast, to the southwest, to the northwest, downward, and upward.

source: །སེམས་ཀྱི་སྐད་ཅིག་རེ་རེ་ཞིང་ཡང་ཤར་ཕྱོགས་ལོགས་སུ་འཇིག་རྟེན་གྱི་ཁམས་གཅིག་ཀྱང་འདའོ།
en: In one instant of mind, they go beyond one world realm in the east.

source: །འཇིག་རྟེན་གྱི་ཁམས་གཉིས་དང་བཅུ་ཡང་འདའོ།
en: “They go beyond two world realms and ten world realms.

source: །འཇིག་རྟེན་གྱི་ཁམས་བརྒྱ་དང་། འཇིག་རྟེན་གྱི་ཁམས་སྟོང་དང་། འཇིག་རྟེན་གྱི་ཁམས་བརྒྱ་ཕྲག་སྟོང་དང་། འཇིག་རྟེན་གྱི་ཁམས་བྱེ་བ་དང་། འཇིག་རྟེན་གྱི་ཁམས་བྱེ་བ་ཕྲག་བརྒྱ་དང་འཇིག་རྟེན་གྱི་ཁམས་བྱེ་བ་ཕྲག་སྟོང་དང་། འཇིག་རྟེན་གྱི་ཁམས་བྱེ་བ་བརྒྱ་ཕྲག་སྟོང་དང་། འཇིག་རྟེན་གྱི་ཁམས་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་ཕྲག་སྟོང་དང་། འཇིག་རྟེན་གྱི་ཁམས་ཚད་མེད་པ་དང་། འཇིག་རྟེན་གྱི་ཁམས་དཔག་ཏུ་མེད་པ་དང་། འཇིག་རྟེན་གྱི་ཁམས་གྲངས་མེད་པ་དང་འཇིག་རྟེན་གྱི་ཁམས་བསམ་གྱིས་མི་ཁྱབ་པ་དང་། འཇིག་རྟེན་གྱི་ཁམས་མཚུངས་པ་མེད་པ་དང་། འཇིག་རྟེན་གྱི་ཁམས་གཞལ་དུ་མེད་པ་དང་། འཇིག་རྟེན་གྱི་ཁམས་ཀུན་ཏུ་མཐའ་ཡས་པ་དང་། འཇིག་རྟེན་གྱི་ཁམས་མུ་མེད་པ་དང་འཇིག་རྟེན་གྱི་ཁམས་མཚམས་མེད་པ་དང་། འཇིག་རྟེན་གྱི་ཁམས་བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པ་དག་ཀྱང་འདའ་བར་བྱེད་དེ།
en: They go beyond a hundred world realms. They go beyond a thousand world realms, a hundred thousand world realms, ten million world realms, a billion world realms, a trillion world realms, a quintillion world realms, an incalculable number of world realms, a measureless number of world realms, innumerable world realms, an inconceivable number of world realms, an unequaled number of world realms, an unfathomable number of world realms, an infinite number of world realms, an endless number of world realms, limitless world realms, and an inexpressible number of world realms.
